Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>testground</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository.this["pm"] will be updated in-place
  ~ resource "github_repository" "this" {
      ~ archived               = false -> true
        id                     = "pm"
        name                   = "pm"
        # (27 unchanged attributes hidden)
    }

  # github_repository_collaborator.this["infra:stebalien"] will be destroyed
  # (because key ["infra:stebalien"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "infra:Stebalien" -> null
      - permission = "push" -> null
      - repository = "infra" -> null
      - username   = "Stebalien" -> null
    }

  # github_repository_collaborator.this["learning-example-tg:bokimilinkovic"] will be destroyed
  # (because key ["learning-example-tg:bokimilinkovic"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "learning-example-tg:bokimilinkovic" -> null
      - permission = "push" -> null
      - repository = "learning-example-tg" -> null
      - username   = "bokimilinkovic" -> null
    }

  # github_repository_collaborator.this["learning-example-tg:brdji"] will be destroyed
  # (because key ["learning-example-tg:brdji"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "learning-example-tg:brdji" -> null
      - permission = "admin" -> null
      - repository = "learning-example-tg" -> null
      - username   = "brdji" -> null
    }

  # github_repository_collaborator.this["learning-example-tg:stefangajic"] will be destroyed
  # (because key ["learning-example-tg:stefangajic"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "learning-example-tg:StefanGajic" -> null
      - permission = "push" -> null
      - repository = "learning-example-tg" -> null
      - username   = "StefanGajic" -> null
    }

  # github_repository_collaborator.this["learning-example:brdji"] will be destroyed
  # (because key ["learning-example:brdji"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "learning-example:brdji" -> null
      - permission = "admin" -> null
      - repository = "learning-example" -> null
      - username   = "brdji" -> null
    }

  # github_repository_collaborator.this["plan-templates:coryschwartz"] will be destroyed
  # (because key ["plan-templates:coryschwartz"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "plan-templates:coryschwartz" -> null
      - permission = "admin" -> null
      - repository = "plan-templates" -> null
      - username   = "coryschwartz" -> null
    }

  # github_repository_collaborator.this["sdk-go:stebalien"] will be destroyed
  # (because key ["sdk-go:stebalien"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "sdk-go:Stebalien" -> null
      - permission = "push" -> null
      - repository = "sdk-go" -> null
      - username   = "Stebalien" -> null
    }

  # github_repository_collaborator.this["sdk-js:hacdias"] will be destroyed
  # (because key ["sdk-js:hacdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "sdk-js:hacdias" -> null
      - permission = "admin" -> null
      - repository = "sdk-js" -> null
      - username   = "hacdias" -> null
    }

  # github_repository_collaborator.this["sync-service:hacdias"] will be destroyed
  # (because key ["sync-service:hacdias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "sync-service:hacdias" -> null
      - permission = "admin" -> null
      - repository = "sync-service" -> null
      - username   = "hacdias" -> null
    }

  # github_repository_collaborator.this["testground:achingbrain"] will be destroyed
  # (because key ["testground:achingbrain"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:achingbrain" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "achingbrain" -> null
    }

  # github_repository_collaborator.this["testground:aschmahmann"] will be destroyed
  # (because key ["testground:aschmahmann"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:aschmahmann" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "aschmahmann" -> null
    }

  # github_repository_collaborator.this["testground:coryschwartz"] will be destroyed
  # (because key ["testground:coryschwartz"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:coryschwartz" -> null
      - permission = "admin" -> null
      - repository = "testground" -> null
      - username   = "coryschwartz" -> null
    }

  # github_repository_collaborator.this["testground:daviddias"] will be destroyed
  # (because key ["testground:daviddias"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:daviddias" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "daviddias" -> null
    }

  # github_repository_collaborator.this["testground:dirkmc"] will be destroyed
  # (because key ["testground:dirkmc"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:dirkmc" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "dirkmc" -> null
    }

  # github_repository_collaborator.this["testground:gmasgras"] will be destroyed
  # (because key ["testground:gmasgras"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:gmasgras" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "gmasgras" -> null
    }

  # github_repository_collaborator.this["testground:jacobheun"] will be destroyed
  # (because key ["testground:jacobheun"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:jacobheun" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "jacobheun" -> null
    }

  # github_repository_collaborator.this["testground:lanzafame"] will be destroyed
  # (because key ["testground:lanzafame"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:lanzafame" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "lanzafame" -> null
    }

  # github_repository_collaborator.this["testground:petar"] will be destroyed
  # (because key ["testground:petar"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:petar" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "petar" -> null
    }

  # github_repository_collaborator.this["testground:raulk"] will be destroyed
  # (because key ["testground:raulk"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:raulk" -> null
      - permission = "admin" -> null
      - repository = "testground" -> null
      - username   = "raulk" -> null
    }

  # github_repository_collaborator.this["testground:stebalien"] will be destroyed
  # (because key ["testground:stebalien"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:Stebalien" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "Stebalien" -> null
    }

  # github_repository_collaborator.this["testground:vyzo"] will be destroyed
  # (because key ["testground:vyzo"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "testground:vyzo" -> null
      - permission = "push" -> null
      - repository = "testground" -> null
      - username   = "vyzo" -> null
    }

  # github_repository_collaborator.this["tg-cypress-test:brdji"] will be destroyed
  # (because key ["tg-cypress-test:brdji"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "tg-cypress-test:brdji" -> null
      - permission = "admin" -> null
      - repository = "tg-cypress-test" -> null
      - username   = "brdji" -> null
    }

  # github_team.this["alumni"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Alumni"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["alumni:abominablesnowman730"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "AbominableSnowman730"
    }

  # github_team_membership.this["alumni:bokimilinkovic"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "bokimilinkovic"
    }

  # github_team_membership.this["alumni:brdji"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "brdji"
    }

  # github_team_membership.this["alumni:dektech"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "dektech"
    }

  # github_team_membership.this["alumni:kale98"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "Kale98"
    }

  # github_team_membership.this["alumni:katarinaketi"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "KatarinaKeti"
    }

  # github_team_membership.this["alumni:ludisistemas"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "LudiSistemas"
    }

  # github_team_membership.this["alumni:stefangajic"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "StefanGajic"
    }

  # github_team_membership.this["alumni:stefanmiletich"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "StefanMiletich"
    }

  # github_team_repository.this["admins:learning-example"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "learning-example"
      + team_id    = "3785059"
    }

  # github_team_repository.this["admins:learning-example-tg"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "learning-example-tg"
      + team_id    = "3785059"
    }

  # github_team_repository.this["admins:testground-github-action"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "testground-github-action"
      + team_id    = "3785059"
    }

  # github_team_repository.this["celestia:docs"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "docs"
      + team_id    = "7138226"
    }

  # github_team_repository.this["celestia:sdk-go"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "sdk-go"
      + team_id    = "7138226"
    }

  # github_team_repository.this["celestia:sdk-js"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "sdk-js"
      + team_id    = "7138226"
    }

  # github_team_repository.this["celestia:sdk-rust"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "sdk-rust"
      + team_id    = "7138226"
    }

  # github_team_repository.this["celestia:sync-service"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "sync-service"
      + team_id    = "7138226"
    }

  # github_team_repository.this["celestia:testground"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "7138226:testground"
      ~ permission = "triage" -> "push"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["maintainers:learning-example"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "learning-example"
      + team_id    = "3723476"
    }

  # github_team_repository.this["maintainers:learning-example-tg"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "learning-example-tg"
      + team_id    = "3723476"
    }

  # github_team_repository.this["maintainers:testground-github-action"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "testground-github-action"
      + team_id    = "3723476"
    }

Plan: 21 to add, 2 to change, 22 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->